#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = false
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://bcmohtpl.my.salesforce.com/*",
        ]
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.TPL.keycloak_openid_client_default_scopes.client_default_scopes will be created
  + resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      + client_id      = (known after apply)
      + default_scopes = [
          + "email",
          + "profile",
          + "roles",
          + "web-origins",
        ]
      + id             = (known after apply)
      + realm_id       = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.TPL.keycloak_openid_user_client_role_protocol_mapper.client_role_mapper will be created
  + resource "keycloak_openid_user_client_role_protocol_mapper" "client_role_mapper" {
      + add_to_access_token         = true
      + add_to_id_token             = true
      + add_to_userinfo             = true
      + claim_name                  = "roles"
      + claim_value_type            = "String"
      + client_id                   = (known after apply)
      + client_id_for_role_mappings = "TPL"
      + id                          = (known after apply)
      + multivalued                 = true
      + name                        = "client roles"
      + realm_id                    = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.TPL-MANAGEMENT.keycloak_group.GROUP will be created
  + resource "keycloak_group" "GROUP" {
      + id       = (known after apply)
      + name     = "TPL Management"
      + path     = (known after apply)
      + realm_id = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.TPL-MANAGEMENT.keycloak_group_roles.GROUP_ROLES will be created
  + resource "keycloak_group_roles" "GROUP_ROLES" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "moh_applications"
      + role_ids   = (known after apply)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.TPL.module.client-roles.keycloak_role.ROLES["TPL-Case-Analyst"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "TPL-Case-Analyst"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.TPL.module.client-roles.keycloak_role.ROLES["TPL-Finance-Analyst"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "TPL-Finance-Analyst"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.TPL.module.client-roles.keycloak_role.ROLES["TPL-System-Administrator"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "TPL-System-Administrator"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-tpl"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "64028a9d-1033-438f-8db8-681dc0a97e51"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-tpl"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "bd2e86ec-254f-4ddf-82f3-6e31e70b5bd8"
      + id        = (known after apply)
      + name      = "view-client-tpl"
      + realm_id  = "moh_applications"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*